<template>
    <div class="content">
        <div class="headTitle">
            学校概况
        </div>
        <div class="content_main">
            <img src="@/assets/School/introduce/zm001.jpg" alt="">
            <div class="content_info">
                <div class="school_title">这是一个名称</div>
                <div class="school_explain">
                    <p>
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                    </p>
                     <p>
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                        这是一段介绍这是一段介绍这是一段介绍这是一段介绍
                    </p>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
  name: 'introduce_index',
  data () {
    return {
     
    }
  }
}
</script>

<style lang="scss" scoped>
    .content_main {
        position: relative;
        img {
            width: 100%;
        }
        .content_info {
            position: absolute;
            top: 0;
            left: 0;
            bottom: 0;
            right: 0;
            background: rgba(255,255,255,0.7);
            box-sizing: border-box;
            padding: 15px;
        }
        .school_title {
            font-size: 30px;
            color: #fff;
            letter-spacing:0;
            text-shadow: 0px 1px 0px #999, 
            0px 2px 0px #888, 0px 3px 0px #777, 
            0px 4px 0px #666, 0px 5px 0px #555, 
            0px 6px 0px #444, 0px 7px 0px #333, 
            0px 8px 7px #001135;
        }
        .school_explain {
            color: #000;
             p {
                text-indent: 32px;
            }
        }
    }
</style>
